package main

import (
	"fmt"
	"time"
)

func pause(char string, count int, t time.Duration) {
	if count == 0 {
		count = 1
	}
	if t == 0 {
		t = 25
	}
	for i := 0; i < count; i++ {
		fmt.Print(char)
		time.Sleep(time.Millisecond * t)
	}
	fmt.Print("\n")
}

func proceed(str string) {
	if str == "" {
		str = "Enter"
	}
	fmt.Print("[ ", str, " ] ")
	fmt.Scanf("\n")
}

func victory() {
	fmt.Println(`
	                                            
    	     .---                    
    	    =%=:=%-  -==-            
    	    %=   +# #+::*#           
    	    %=   +*-@    @.          
    	    %=   +#+*   :@           
    	    %=   +##=   =%           
        :==-%=   =%%:   **           
    .+++*#*::=@=   =@@    %=           
    #*  .@.   %=   :@#    @-           
    %=   %:   @#++=.     .@.           
    %*  .@=  #+...-+*+:  .@            
    #%++*-++*@:      :=*++%            
    %=       :#+-.      .+@            
    %=         .=+*=.    .@            
    #*             -:    -@            
    :@.                  %=            
     -%-               :%+             
      .**-.         .-+*:              
        #%++++++==+++#%                
        #*  .:::::.. +%                
        :*++=======++*-                
							 
`)
}

func fail() {
	fmt.Println(`
	
    	           :=+#%@@@@@@@@%#+=:              
    	      :=#@@@@@@%######%@@@@@@#=:          
            =#@@@@*=:.          .:=*@@@@#=        
          +@@@@+:                    :+@@@@+      
        -%@@%=                          =%@@%-    
       *@@@+     .:+*%-        -%*+:.     +@@@*   
      #@@@:   .=#@@@@@*        *@@@@@#=.   :@@@#  
     +@@@:  :#@@@@*-.            .-*@@@@#:  :@@@+ 
    :@@@-    =%*-                    -*%=    -@@@:
    #@@%            :==.      .==:            %@@#
    @@@+           :@@@@.    .@@@@:           +@@@
    @@@=            +##=      =##+            =@@@
    @@@+                                      +@@@
    #@@%           .:-==++++++==-:.           %@@#
    :@@@-        :#@@@@@@@@@@@@@@@@#:        -@@@:
     +@@@:      :@@@*-::......::-*@@@:      :@@@+ 
      #@@@:     -@@@-   ......   -@@@-     :@@@#  
       *@@@+     +@@@@@@@@@@@@@@@@@@+     +@@@*   
        -%@@%=    .=****++++++****=.    =%@@%-    
          +@@@@+:                    :+@@@@+      
            =#@@@@*=:.          .:=*@@@@#=        
    	      :=#@@@@@@%######%@@@@@@#=:          
    		      :=+#%@@@@@@@@%#+=:  
	
	`)
}

func main() {
	// var cont string

	fmt.Print("Загадайте число от 1 до 26")
	pause(".", 3, 300)
	proceed("Нажмите Enter для продолжения")

	fmt.Print("Теперь умножьте загаданное число на 2")
	pause(".", 3, 400)
	proceed("")

	fmt.Print("Теперь нужно прибавить 8")
	pause(".", 3, 400)
	proceed("")

	fmt.Print("Результат разделите на 2")
	pause(".", 4, 400)
	proceed("")

	fmt.Print("Последнее действие!\nИз результата нужно вычесть первоначально загаданное число")
	pause(".", 5, 400)
	proceed("")

	fmt.Println("Результат равен 4? Верно?")
	var success string
	fmt.Print("[ Y / N? ] ")
	fmt.Scanf("&s\n", &success)

	if success == "" || success == "y" || success == "Y" {
		victory()
	} else {
		fail()
	}
}
